import chinese from "./chinese";
import item from "./item";
import number from "./number";

const surnname =
    "赵钱孙李周吴郑王冯陈褚卫蒋沈韩杨朱秦尤许何吕施张孔曹严华金魏陶姜戚谢邹喻柏水窦章云苏潘葛奚范彭郎鲁韦昌马苗凤花方俞任袁柳酆鲍史唐费廉岑薛雷贺倪汤滕殷罗毕郝邬安常乐于时傅皮卞齐康伍余元卜顾孟平黄和穆萧尹姚邵湛汪祁毛禹狄米贝明臧计伏成戴谈宋茅庞熊纪舒屈项祝董梁杜阮蓝闵席季麻强贾路娄危江童颜郭梅盛林刁锺徐邱骆高夏蔡田樊胡凌霍虞万支柯昝管卢莫经房裘缪干解应宗丁宣贲邓郁单杭洪包诸左石崔吉钮龚程嵇邢滑裴陆荣翁荀羊於惠甄麹家封芮羿储靳汲邴糜松井段富巫乌焦巴弓牧隗山谷车侯宓蓬全郗班仰秋仲伊宫甯仇栾暴甘钭厉戎祖武符刘景詹束龙叶幸司韶郜黎蓟薄印宿白怀蒲邰从鄂索咸籍赖卓蔺屠蒙池乔阴鬱胥能苍双闻莘党翟谭贡劳逄姬申扶堵冉宰郦雍郤璩桑桂濮牛寿通边扈燕冀郏浦尚农温别庄晏柴瞿阎充慕连茹习宦艾鱼容向古易慎戈廖庾终暨居衡步都耿满弘匡国文寇广禄阙东欧殳沃利蔚越夔隆师巩厍聂晁勾敖融冷訾辛阚那简饶空曾毋沙乜养鞠须丰巢关蒯相查后荆红游竺权逯盖益桓公万俟司马上官欧阳夏侯诸葛闻人东方赫连皇甫尉迟公羊澹台公冶宗政濮阳淳于单于太叔申屠公孙仲孙轩辕令狐锺离宇文长孙慕容鲜于闾丘司徒司空亓官司寇仉督子车颛孙端木巫马公西漆雕乐正壤驷公良拓跋夹谷宰父穀梁晋楚闫法汝鄢涂钦段干百里东郭南门呼延归海羊舌微生岳帅缑亢况後有琴梁丘左丘东门西门商牟佘佴伯赏南宫墨哈谯笪年爱阳佟".split(
        ""
    );
/**
 * 生成随机中文姓名
 * @returns 中文姓名
 */
const fn = () => {
    let res = item(surnname);
    for (let i = 0; i < number(1, 2); i++) {
        res += chinese();
    }
    return res;
};
export default fn;
// 基本汉字 20902字	4E00-9FA5
// 基本汉字补充	38字	9FA6-9FCB
// 扩展A	6582字	3400-4DB5
// 扩展B	42711字	20000-2A6D6
// 扩展C	4149字	2A700-2B734
// 扩展D	222字	2B740-2B81D
// 康熙部首	214字	2F00-2FD5
// 部首扩展	115字	2E80-2EF3
// 兼容汉字	477字	F900-FAD9
// 兼容扩展	542字	2F800-2FA1D
// PUA(GBK)部件	81字	E815-E86F
// 部件扩展	452字	E400-E5E8
// PUA增补	207字	E600-E6CF
// 汉字笔画	36字	31C0-31E3
// 汉字结构	12字	2FF0-2FFB
// 汉语注音	22字	3105-3120
// 注音扩展	22字	31A0-31BA
// 〇	1字	3007
